poli-vsb-cz/SDK_2_3_1_MK22DX128xxx5/boards/twrk21d50m/driver_examples/sai/interrupt_transfer/fsl_sgtl5000.h
/*
* DAP_BASS_ENHANCE_CTRL_REG
*/
#define SGTL5000_DAP_BASS_ENHANCE_CTRL_LR_LEVEL_GET_MASK 0x3F00
#define SGTL5000_DAP_BASS_ENHANCE_CTRL_LR_LEVEL_CLR_MASK 0xC0FF
#define SGTL5000_DAP_BASS_ENHANCE_CTRL_LR_LEVEL_SHIFT 0x8
#define SGTL5000_DAP_BASS_ENHANCE_CTRL_BASS_LEVEL_GET_MASK 0x007F
#define SGTL5000_DAP_BASS_ENHANCE_CTRL_BASS_LEVEL_CLR_MASK 0xFF80
#define SGTL5000_DAP_BASS_ENHANCE_CTRL_BASS_LEVEL_SHIFT 0x0

/*
* DAP_AUDIO_EQ_REG
*/
#define SGTL5000_DAP_AUDIO_EQ_EN_GET_MASK 0x0003
#define SGTL5000_DAP_AUDIO_EQ_EN_CLR_MASK 0xFFFC
#define SGTL5000_DAP_AUDIO_EQ_EN_SHIFT 0x0

/*
* DAP_SGTL_SURROUND_REG
*/
#define SGTL5000_DAP_SGTL_SURROUND_WIDTH_CONTROL_GET_MASK 0x0070
#define SGTL5000_DAP_SGTL_SURROUND_WIDTH_CONTROL_CLR_MASK 0xFF8F
#define SGTL5000_DAP_SGTL_SURROUND_WIDTH_CONTROL_SHIFT 0x4
#define SGTL5000_DAP_SGTL_SURROUND_SEL_GET_MASK 0x0003
#define SGTL5000_DAP_SGTL_SURROUND_SEL_CLR_MASK 0xFFFC
#define SGTL5000_DAP_SGTL_SURROUND_SEL_SHIFT 0x0

/*
* DAP_FILTER_COEF_ACCESS_REG
*/
#define SGTL5000_DAP_FILTER_COEF_ACCESS_DEBUG_GET_MASK 0x1000
#define SGTL5000_DAP_FILTER_COEF_ACCESS_DEBUG_CLR_MASK 0xEFFF
#define SGTL5000_DAP_FILTER_COEF_ACCESS_DEBUG_SHIFT 0xC
#define SGTL5000_DAP_FILTER_COEF_ACCESS_RD_GET_MASK 0x0200
#define SGTL5000_DAP_FILTER_COEF_ACCESS_RD_CLR_MASK 0xFDFF
#define SGTL5000_DAP_FILTER_COEF_ACCESS_RD_SHIFT 0x9
#define SGTL5000_DAP_FILTER_COEF_ACCESS_WR_GET_MASK 0x0100
#define SGTL5000_DAP_FILTER_COEF_ACCESS_WR_CLR_MASK 0xFEFF
#define SGTL5000_DAP_FILTER_COEF_ACCESS_WR_SHIFT 0x8
#define SGTL5000_DAP_FILTER_COEF_ACCESS_INDEX_GET_MASK 0x00FF
#define SGTL5000_DAP_FILTER_COEF_ACCESS_INDEX_CLR_MASK 0xFF00
#define SGTL5000_DAP_FILTER_COEF_ACCESS_INDEX_SHIFT 0x0

/*
*  DAP_COEF_WR_B0_MSB_REG
*/
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_19_GET_MASK 0x8000
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_19_CLR_MASK 0x7FFF
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_19_SHIFT 0xF
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_18_GET_MASK 0x4000
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_18_CLR_MASK 0xBFFF
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_18_SHIFT 0xE
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_17_GET_MASK 0x2000
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_17_CLR_MASK 0xDFFF
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_17_SHIFT 0xD
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_16_GET_MASK 0x1000
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_16_CLR_MASK 0xEFFF
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_16_SHIFT 0xC
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_15_GET_MASK 0x0800
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_15_CLR_MASK 0xF7FF
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_15_SHIFT 0xB
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_14_GET_MASK 0x0400
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_14_CLR_MASK 0xFBFF
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_14_SHIFT 0xA
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_13_GET_MASK 0x0200
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_13_CLR_MASK 0xFDFF
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_13_SHIFT 0x9
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_12_GET_MASK 0x0100
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_12_CLR_MASK 0xFEFF
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_12_SHIFT 0x8
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_11_GET_MASK 0x0080
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_11_CLR_MASK 0xFF7F
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_11_SHIFT 0x7
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_10_GET_MASK 0x0040
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_10_CLR_MASK 0xFFBF
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_10_SHIFT 0x6
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_9_GET_MASK 0x0020
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_9_CLR_MASK 0xFFDF
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_9_SHIFT 0x5
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_8_GET_MASK 0x0010
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_8_CLR_MASK 0xFFEF
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_8_SHIFT 0x4
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_7_GET_MASK 0x0008
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_7_CLR_MASK 0xFFF7
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_7_SHIFT 0x3
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_6_GET_MASK 0x0004
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_6_CLR_MASK 0xFFFB
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_6_SHIFT 0x2
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_5_GET_MASK 0x0002
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_5_CLR_MASK 0xFFFD
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_5_SHIFT 0x1
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_4_GET_MASK 0x0001
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_4_CLR_MASK 0xFFFE
#define SGTL5000_DAP_COEF_WR_B0_MSB_BIT_4_SHIFT 0x0

/*
* DAP_COEF_WR_B0_LSB_REG
*/
#define SGTL5000_DAP_COEF_WR_B0_LSB_BIT_3_GET_MASK 0x0008
#define SGTL5000_DAP_COEF_WR_B0_LSB_BIT_3_CLR_MASK 0xFFF7
#define SGTL5000_DAP_COEF_WR_B0_LSB_BIT_3_SHIFT 0x3
#define SGTL5000_DAP_COEF_WR_B0_LSB_BIT_2_GET_MASK 0x0004
#define SGTL5000_DAP_COEF_WR_B0_LSB_BIT_2_CLR_MASK 0xFFFB
#define SGTL5000_DAP_COEF_WR_B0_LSB_BIT_2_SHIFT 0x2
#define SGTL5000_DAP_COEF_WR_B0_LSB_BIT_1_GET_MASK 0x0002
#define SGTL5000_DAP_COEF_WR_B0_LSB_BIT_1_CLR_MASK 0xFFFD
#define SGTL5000_DAP_COEF_WR_B0_LSB_BIT_1_SHIFT 0x1
#define SGTL5000_DAP_COEF_WR_B0_LSB_BIT_0_GET_MASK 0x0001
#define SGTL5000_DAP_COEF_WR_B0_LSB_BIT_0_CLR_MASK 0xFFFE
#define SGTL5000_DAP_COEF_WR_B0_LSB_BIT_0_SHIFT 0x0

/*
* DAP_AUDIO_EQ_BASS_BAND0_REG
*/
#define SGTL5000_DAP_AUDIO_EQ_BASS_BAND0_VOLUME_GET_MASK 0x007F
#define SGTL5000_DAP_AUDIO_EQ_BASS_BAND0_VOLUME_CLR_MASK 0xFF80
#define SGTL5000_DAP_AUDIO_EQ_BASS_BAND0_VOLUME_SHIFT 0x0

/*
* DAP_AUDIO_EQ_BAND1_REG
*/
#define SGTL5000_DAP_AUDIO_EQ_BAND1_VOLUME_GET_MASK 0x007F
#define SGTL5000_DAP_AUDIO_EQ_BAND1_VOLUME_CLR_MASK 0xFF80
#define SGTL5000_DAP_AUDIO_EQ_BAND1_VOLUME_SHIFT 0x0

/*
* DAP_AUDIO_EQ_BAND2_REG
*/
#define SGTL5000_DAP_AUDIO_EQ_BAND2_VOLUME_GET_MASK 0x007F
#define SGTL5000_DAP_AUDIO_EQ_BAND2_VOLUME_CLR_MASK 0xFF80
#define SGTL5000_DAP_AUDIO_EQ_BAND2_VOLUME_SHIFT 0x0

/*
* DAP_AUDIO_EQ_BAND3_REG
*/
#define SGTL5000_DAP_AUDIO_EQ_BAND3_VOLUME_GET_MASK 0x007F
#define SGTL5000_DAP_AUDIO_EQ_BAND3_VOLUME_CLR_MASK 0xFF80
#define SGTL5000_DAP_AUDIO_EQ_BAND3_VOLUME_SHIFT 0x0

