poli-vsb-cz/SDK_2_3_1_MK22DX128xxx5/boards/twrk21d50m/driver_examples/sai/interrupt_transfer/fsl_sgtl5000.h
/*
* DAP_AUDIO_EQ_TREBLE_BAND4_REG
*/
#define SGTL5000_DAP_AUDIO_EQ_TREBLE_BAND4_VOLUME_GET_MASK 0x007F
#define SGTL5000_DAP_AUDIO_EQ_TREBLE_BAND4_VOLUME_CLR_MASK 0xFF80
#define SGTL5000_DAP_AUDIO_EQ_TREBLE_BAND4_VOLUME_SHIFT 0x0

/*
* DAP_MAIN_CHAN_REG
*/
#define SGTL5000_DAP_MAIN_CHAN_VOL_GET_MASK 0xFFFF
#define SGTL5000_DAP_MAIN_CHAN_VOL_CLR_MASK 0x0000
#define SGTL5000_DAP_MAIN_CHAN_VOL_SHIFT 0x0

/*
* DAP_MIX_CHAN_REG
*/
#define SGTL5000_DAP_MIX_CHAN_VOL_GET_MASK 0xFFFF
#define SGTL5000_DAP_MIX_CHAN_VOL_CLR_MASK 0x0000
#define SGTL5000_DAP_MIX_CHAN_VOL_SHIFT 0x0

/*
* DAP_AVC_CTRL_REG
*/
#define SGTL5000_DAP_AVC_CTRL_APOP_ENABLE_GET_MASK 0x4000
#define SGTL5000_DAP_AVC_CTRL_APOP_ENABLE_CLR_MASK 0xBFFF
#define SGTL5000_DAP_AVC_CTRL_APOP_ENABLE_SHIFT 0xE
#define SGTL5000_DAP_AVC_CTRL_MAX_GAIN_GET_MASK 0x3000
#define SGTL5000_DAP_AVC_CTRL_MAX_GAIN_CLR_MASK 0xCFFF
#define SGTL5000_DAP_AVC_CTRL_MAX_GAIN_SHIFT 0xC
#define SGTL5000_DAP_AVC_CTRL_LBI_RESPONSE_GET_MASK 0x0300
#define SGTL5000_DAP_AVC_CTRL_LBI_RESPONSE_CLR_MASK 0xFCFF
#define SGTL5000_DAP_AVC_CTRL_LBI_RESPONSE_SHIFT 0x8
#define SGTL5000_DAP_AVC_CTRL_HARD_LIMIT_EN_GET_MASK 0x0020
#define SGTL5000_DAP_AVC_CTRL_HARD_LIMIT_EN_CLR_MASK 0xFFDF
#define SGTL5000_DAP_AVC_CTRL_HARD_LIMIT_EN_SHIFT 0x5
#define SGTL5000_DAP_AVC_CTRL_STOP_GET_MASK 0x0004
#define SGTL5000_DAP_AVC_CTRL_STOP_SHIFT 0x2
#define SGTL5000_DAP_AVC_CTRL_RUNNING_GET_MASK 0x0002
#define SGTL5000_DAP_AVC_CTRL_RUNNING_SHIFT 0x1
#define SGTL5000_DAP_AVC_CTRL_EN_GET_MASK 0x0001
#define SGTL5000_DAP_AVC_CTRL_EN_CLR_MASK 0xFFFE
#define SGTL5000_DAP_AVC_CTRL_EN_SHIFT 0x0

/*
* DAP_AVC_ATTACK_REG
*/
#define SGTL5000_DAP_AVC_ATTACK_RATE_GET_MASK 0x0FFF
#define SGTL5000_DAP_AVC_ATTACK_RATE_CLR_MASK 0xF000
#define SGTL5000_DAP_AVC_ATTACK_RATE_SHIFT 0x0

/*
* DAP_AVC_DECAY_REG
*/
#define SGTL5000_DAP_AVC_DECAY_RATE_GET_MASK 0x0FFF
#define SGTL5000_DAP_AVC_DECAY_RATE_CLR_MASK 0xF000
#define SGTL5000_DAP_AVC_DECAY_RATE_SHIFT 0x0

/*
* DAP_COEF_WR_B1_LSB_REG
*/
#define SGTL5000_DAP_COEF_WR_B1_LSB_LSB_GET_MASK 0x000F
#define SGTL5000_DAP_COEF_WR_B1_LSB_LSB_CLR_MASK 0xFFF0
#define SGTL5000_DAP_COEF_WR_B1_LSB_LSB_SHIFT 0x0

/*
* DAP_COEF_WR_B2_LSB_REG
*/
#define SGTL5000_DAP_COEF_WR_B2_LSB_LSB_GET_MASK 0x000F
#define SGTL5000_DAP_COEF_WR_B2_LSB_LSB_CLR_MASK 0xFFF0
#define SGTL5000_DAP_COEF_WR_B2_LSB_LSB_SHIFT 0x0

/*
* DAP_COEF_WR_A1_LSB_REG
*/
#define SGTL5000_DAP_COEF_WR_A1_LSB_LSB_GET_MASK 0x000F
#define SGTL5000_DAP_COEF_WR_A1_LSB_LSB_CLR_MASK 0xFFF0
#define SGTL5000_DAP_COEF_WR_A1_LSB_LSB_SHIFT 0x0

/*
* DAP_COEF_WR_A2_LSB_REG
*/
#define SGTL5000_DAP_COEF_WR_A2_LSB_LSB_GET_MASK 0x000F
#define SGTL5000_DAP_COEF_WR_A2_LSB_LSB_CLR_MASK 0xFFF0
#define SGTL5000_DAP_COEF_WR_A2_LSB_LSB_SHIFT 0x0

/*! @brief SGTL5000 I2C address. */
#define SGTL5000_I2C_ADDR 0x0A

/*! @brief Modules in Sgtl5000 board. */
typedef enum _sgtl5000_module
{
    kSGTL_ModuleADC = 0x0, /*!< ADC module in SGTL5000 */
    kSGTL_ModuleDAC,       /*!< DAC module in SGTL5000 */
    kSGTL_ModuleDAP,       /*!< DAP module in SGTL5000 */
    kSGTL_ModuleHP,        /*!< Headphone module in SGTL5000 */
    kSGTL_ModuleI2SIN,     /*!< I2S-IN module in SGTL5000 */
    kSGTL_ModuleI2SOUT,    /*!< I2S-OUT module in SGTL5000 */
    kSGTL_ModuleLineIn,    /*!< Line-in moudle in SGTL5000 */
    kSGTL_ModuleLineOut,   /*!< Line-out module in SGTL5000 */
    kSGTL_ModuleMicin      /*!< Micphone module in SGTL5000 */
} sgtl_module_t;

/*!
* @brief Sgtl5000 data route.
* @note Only provide some typical data route, not all route listed.
* Users cannot combine any routes, once a new route is set, the precios one would be replaced.
*/
typedef enum _sgtl_route
{
    kSGTL_RouteBypass = 0x0,             /*!< LINEIN->Headphone. */
    kSGTL_RoutePlayback,                 /*!< I2SIN->DAC->Headphone. */
    kSGTL_RoutePlaybackandRecord,        /*!< I2SIN->DAC->Headphone, LINEIN->ADC->I2SOUT. */
    kSGTL_RoutePlaybackwithDAP,          /*!< I2SIN->DAP->DAC->Headphone. */
    kSGTL_RoutePlaybackwithDAPandRecord, /*!< I2SIN->DAP->DAC->HP, LINEIN->ADC->I2SOUT. */
    kSGTL_RouteRecord                    /*!< LINEIN->ADC->I2SOUT. */
} sgtl_route_t;

/*!
* @brief The audio data transfer protocol choice.
* Sgtl5000 only supports I2S format and PCM format.
*/
typedef enum _sgtl_protocol
{
    kSGTL_BusI2S = 0x0,      /*!< I2S Type */
    kSGTL_BusLeftJustified,  /*!< Left justified */
    kSGTL_BusRightJustified, /*!< Right Justified */
    kSGTL_BusPCMA,           /*!< PCMA */
    kSGTL_BusPCMB            /*!< PCMB */
} sgtl_protocol_t;

/*! @brief sgtl configure definition. This structure should be global.*/
typedef struct _sgtl_handle
{
#if defined(FSL_FEATURE_SOC_LPI2C_COUNT) && (FSL_FEATURE_SOC_LPI2C_COUNT)
    LPI2C_Type *base;
    lpi2c_master_transfer_t xfer;
    lpi2c_master_handle_t *i2cHandle;
#else
    /* I2C relevant definition. */
    I2C_Type *base;                 /*!< I2C instance. */
    i2c_master_transfer_t xfer;     /*!< I2C device setting */
    i2c_master_handle_t *i2cHandle; /*!< I2C internal state space. */
#endif
} sgtl_handle_t;

/*! @brief Initailize structure of sgtl5000 */
typedef struct _sgtl_config
{
    sgtl_route_t route;  /*!< Audio data route.*/
    sgtl_protocol_t bus; /*!< Audio transfer protocol */
    bool master_slave;   /*!< Master or slave. True means master, false means slave. */
} sgtl_config_t;

/*******************************************************************************
 * API
 ******************************************************************************/
#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief sgtl5000 initialize function.
 *
 * This function calls SGTL_I2CInit(), and in this function, some configurations
 * are fixed. The second parameter can be NULL. If users want to change the SGTL5000 settings,
 * a configure structure should be prepared.
 * @note If the codec_config is NULL, it would initialize sgtl5000 using default settings.
 * The default setting:
 * @code
 * sgtl_init_t codec_config
 * codec_config.route = kSGTL_RoutePlaybackandRecord
 * codec_config.bus = kSGTL_BusI2S
 * codec_config.master = slave
 * @endcode
 *
 * @param handle Sgtl5000 handle structure.
 * @param codec_config sgtl5000 configuration structure. If this pointer equals to NULL,
 * it means using the default configuration.
 * @return Initialization status
 */
void SGTL_Init(sgtl_handle_t *handle, sgtl_config_t *config);

/*!
 * @brief Set audio data route in sgtl5000.
 *
 * This function would set the data route according to route. The route cannot be combined,
 * as all route would enable different modules.
 *
 * @note If a new route is set, the previous route would not work.
 * @param handle Sgtl5000 handle structure.
 * @param route Audio data route in sgtl5000.
 */
status_t SGTL_SetDataRoute(sgtl_handle_t *handle, sgtl_route_t route);

/*!
 * @brief Set the audio transfer protocol.
 *
 * Sgtl5000 only supports I2S, I2S left, I2S right, PCM A, PCM B format.
 * @param handle Sgtl5000 handle structure.
 * @param bus Audio data transfer protocol.
 */
status_t SGTL_SetProtocol(sgtl_handle_t *handle, sgtl_protocol_t protocol);

/*!
 * @brief Set sgtl5000 as master or slave.
 *
 * @param handle Sgtl5000 handle structure.
 * @param master 1 represent master, 0 represent slave.
 */
void SGTL_SetMasterSlave(sgtl_handle_t *handle, bool master);

/*!
 * @brief Set the volume of different modules in sgtl5000.
 *
 * This function would set the volume of sgtl5000 modules. This interface set module volume.
 * The function assume that left channel and right channel has the same volume.
 * @param handle Sgtl5000 handle structure.
 * @param module Sgtl5000 module, such as DAC, ADC and etc.
 * @param volume Volume value need to be set. The value is the exact value in register.
 */
status_t SGTL_SetVolume(sgtl_handle_t *handle, sgtl_module_t module, uint32_t volume);

/*!
 * @brief Get the volume of different modules in sgtl5000.
 *
 * This function gets the volume of sgtl5000 modules. This interface get DAC module volume.
 * The function assume that left channel and right channel has the same volume.
 * @param handle Sgtl5000 handle structure.
 * @param module Sgtl5000 module, such as DAC, ADC and etc.
 * @return Module value, the value is exact value in register.
 */
uint32_t SGTL_GetVolume(sgtl_handle_t *handle, sgtl_module_t module);

/*!
 * @brief Mute/unmute modules in sgtl5000.
 *
 * @param handle Sgtl5000 handle structure.
 * @param module Sgtl5000 module, such as DAC, ADC and etc.
 * @param mute True means mute, and false means unmute.
 */
status_t SGTL_SetMute(sgtl_handle_t *handle, sgtl_module_t module, bool mute);

/*!
 * @brief Enable expected devices.
 * @param handle Sgtl5000 handle structure.
 * @param module Module expected to enable.
 */
status_t SGTL_EnableModule(sgtl_handle_t *handle, sgtl_module_t module);

/*!
 * @brief Disable expected devices.
 * @param handle Sgtl5000 handle structure.
 * @param module Module expected to enable.
 */
status_t SGTL_DisableModule(sgtl_handle_t *handle, sgtl_module_t module);

/*!
 * @brief Deinit the sgtl5000 codec. Shut down Sgtl5000 modules.
 * @param handle Sgtl5000 handle structure pointer.
 */
void SGTL_Deinit(sgtl_handle_t *handle);

/*!
 * @brief Configure the data format of audio data.
 *
 * This function would configure the registers about the sample rate, bit depths.
 * @param handle Sgtl5000 handle structure pointer.
 * @param mclk Master clock frequency of I2S.
 * @param sample_rate Sample rate of audio file running in sgtl5000. Sgtl5000 now
 * supports 8k, 11.025k, 12k, 16k, 22.05k, 24k, 32k, 44.1k, 48k and 96k sample rate.
 * @param bits Bit depth of audio file (Sgtl5000 only supports 16bit, 20bit, 24bit
 * and 32 bit in HW).
 */
status_t SGTL_ConfigDataFormat(sgtl_handle_t *handle, uint32_t mclk, uint32_t sample_rate, uint8_t bits);

/*!
 * @brief Write register to sgtl using I2C.
 * @param handle Sgtl5000 handle structure.
 * @param reg The register address in sgtl.
 * @param val Value needs to write into the register.
 */
status_t SGTL_WriteReg(sgtl_handle_t *handle, uint16_t reg, uint16_t val);

/*!
 * @brief Read register from sgtl using I2C.
 * @param handle Sgtl5000 handle structure.
 * @param reg The register address in sgtl.
 * @param val Value written to.
 */
status_t SGTL_ReadReg(sgtl_handle_t *handle, uint16_t reg, uint16_t *val);

/*!
 * @brief Modify some bits in the register using I2C.
 * @param handle Sgtl5000 handle structure.
 * @param reg The register address in sgtl.
 * @param mask The mask code for the bits want to write. The bit you want to write should be 0.
 * @param val Value needs to write into the register.
 */
status_t SGTL_ModifyReg(sgtl_handle_t *handle, uint16_t reg, uint16_t clr_mask, uint16_t val);

#if defined(__cplusplus)
}
#endif

/*! @} */

#endif /* _FSL_SGTL5000_H_ */
